<?php
/**
 * 接口错误码
 *
 */
$config['error_code'] = array(
    //接口级别错误
    1001  => '文件错误',
    1002  => '接口错误',
    1003  => '环境错误',
    //环境级别错误
    2001  => 'Redis错误',
    2002  => 'Redis无法连接',
    2003  => '暂未启用Redis数据处理，请先关闭',
    2004 => '数据库连接错误',

    //业务级别错误
    3001  => '参数错误',
    


    //权限认证错误
    4001  => '认证失败',
    4002  => '认证不通过',
    4003  => '口令错误',
    4004  => '请求次数已达上限',
    4005  => '请求被禁止',
    4006  => '接口配置错误',
    4007  => 'Illegal access',
    4008  => '参数存在非法字段',
    
    //运行过程中错误
    5001  => '请求资源被占用',    

    // 操作类异常
    6001 => '删除失败',
    6002 => '查询数据不存在',
    6003 => '编辑失败',
    6004 => '新增失败'
    
    
);